{
    "translation": {
        "_Comment": "SECTION HOME",
        "myNameIs": "Olá, meu nome é",
        "description": "Sou um programador especializado em construir (e ocasionalmente fazer o design) experiências digitais excepcionais. Atualmente, estou focado em construir aplicações mobile com React-Nate e  aplicações Web full-stack.",
        "resume": "Veja meu curriculo",
        "cvLink": "https://drive.google.com/file/d/1bVcv5jB8yVcn7n0dJr_s5BEzvDz4upSc/view?usp=sharing",
        "_Comment2": "SECTION ABOUT",
        "aboutTitle": "Sobre",
        "aboutIntro": "Oi. Eu sou Carlos Daniel, prazer em conhecê-lo.",
        "aboutMe": "Eu sou um estudante de Ciência da Computação de 20 anos, atualmente estou no 5º período. Sempre me interessei por computadores e programação. Comecei a aprender um pouco de python quando tinha uns 14 anos, mas me apaixonei mesmo quando comecei a aprender html, css e javascript, porque as coisas eram mais concretas, e eu conseguia um retorno imediato sobre o que eu aprendia e construía, foi sencacional ver que eu poderia criar coisas incríveis. Então resolvi entrar nesse mundo, me tornei programador e comecei o Bacharelado em Ciência da Computação. Desde então, sou apaixonado por construir sites e tudo que envolve programação.",
        "_Comment3": "SECTION SKILLS",
        "skills": "Habilidades",
        "theTechnologies": "Essas são as tecnologias que eu trabalhei ou estudei",
        "_Comment4": "SECTION PROJECTS",
        "projects": "Projetos",
        "recentWork": "Veja alguns dos meus últimos trabalhos",
        "passMouseToSee": "Passe o mouse sobre os cartões para ver mais",
        "clickToSee": "Clique para ver mais",
        "clickDescription": "Clique aqui para ver a descrição",
        "experience": "Experiência",
        "currently": "Atualmente",
        "codetowerWorkDesc": "Liderava a equipe na realização dos projetos. Na organização, desde planejamento, padrões de projeto, metodologias ágeis e etc. Auxiliava também na programação dos projetos, utilizando diversas tecnologias como Nextjs, Django e Docker entre outras.",
        "conteWorkDesc": "Trabalho na manutenção e implementação de projetos, internos e para clientes, para dispositivos móveis. Desde a criação até a publicação nas principais lojas de aplicativos, como apple store e google play",
        "_Comment5": "SECTION CONTACT",
        "contact": "Contato",
        "submitForm": "Preencha o formulário ou me envie um email - carlosdanielf541@gmail.com",
        "scrollToSee": "Desça para ver minhas redes sociais",
        "name": "Nome",
        "message": "Mensagem",
        "collaborate": "Vamos Colaborar",
        "_Comment6": "description projects",
        "crudDesc": "Criação de site onde é possível cadastrar pessoas, editar e deletar, o famoso crud. A aplicação foi feita ponta a ponta, desde o front-end usando react, até o back-end criando uma api e banco de dados. Para fazer isso projeto, além de conceitos próprios do React como componentização, também foram utilizadas outras ferramentas, para a construção do back-end/api foi utilizado o express js/node.js, e para o banco de dados foi utilizado o MySql. foi implantado no netfly e o back-end no heroku.",
        "cafeChat": "Criação de site, imitando whatsapp, onde é possível adicionar chats por e-mail. React js foi usado para construir o front-end e firebase como banco de dados. A biblioteca de componentes estilizados, react-icons, react-hooks-firebase, entre outros , foi muito utilizado neste projeto.",
        "pokedexDesc": "Projeto Pokédex onde você pode pesquisar pokémon pelo nome ou ID, além de passar por cada pokémon pelo botão. Nesse projeto usamos html, css e javascript. O aprendizado mais importante desse projeto foi aprender a fazer uma api solicitação, foi o primeiro aplicativo que fiz que faz esse tipo de solicitação.",
        "pomodoroDesc": "Site que implementa a técnica Pomodoro, técnica que auxilia na produtividade e no foco. Este projeto foi construído utilizando html, css e javascript. Neste projeto foram abordados os conceitos de DOM (Document Object Model), eventos DOM, criação de funções, além ao uso da função setInterval.",
        "foodDesc": "Landing page feita imitando sites de fast food. Nesse projeto pratiquei minhas habilidades com css, e testei coisas novas. É um projeto simples mas que é bem trabalhado, sendo totalmente responsivo",
        "ranchoDesc": "Projeto freelancer realizado para divulgação de um Rancho. Consiste em uma landing page, feita com nextjs, onde utilizo do conceito de componentes. Além disso nesse projeto utilizei da api do instagram do meta para mostrar as últimas publicações do rancho.",
        "benserDesc": "Neste projeto me tornei um dev fullstack junior na empresa junior Code Tower do IFG. Participei do desenvolvimento de pequenas funcionalidades no projeto. No entanto pude me desenvolver bastante como programador, tive oportunidade de mexer tanto no frontend quanto no backend do projeto.",
        "doulasDesc": "Atuei no projeto liderando a finalização do projeto de um site institucional e sistema de gerenciamento de associadas. Durante a finalização organizamos diversos sprints. Além disso, atuei diretamente programando juntamente com a equipe do projeto e os auxiliando na execução, principalmente no frontend. Nesse projeto utilizamos NextsJS, Java Spring, Postgresql e Docker.",
        "viajahDesc": "Liderei a realização do projeto, bem como implementei quase toda a api e fiz partes importantes da implementação do frontend, como autenticação e o blog. Neste projeto utilizamos Nextjs, Django, Docker, entre outras tecnologias. Além do desenvolvimento e liderança do projeto, também cuidei do deploy do projeto, que foi feito em uma VPS utilizando docker, com um pipeline CI/CD com gh actions e watchtower. Estive presente de ponta a ponta nesse projeto.",
        "cryptoDesc": "Projeto feito para desafio de processo seletivo. Nesse porjeto consegui aprender muitos conceitos fundamentais do React, como react-router-dom para roteamento com react puro e redux para gerenciamente e persistência dos estados. Além disso realizei integração com a metamask, podendo assim exibir o id e o saldo da wallet. Essa aplicação tem como objetivo principal exibir informações de cryptoativos e para isso consumi a api da CoinGecko. Para melhor visualização dos dados, utilizei a biblioteca rechart para criar gráficos dos dados vindos da api.",
        "etoroksDesc": "Projeto freelancer de uma plataforma de sorteios para um canal no youtube. A plataforma permite o cadastro de sorteios e suas respectivas realizações pelo admin. Além disso permite que usuários se conectem utilizando o google através do auth do firebase e que se cadastrem para um sorteio. Nessa plataforma foi utilizada, basicamente Nextjs, Firebase(firestore, auth, storage) e shadcn ui como biblioteca de componentes.",
        "codeTowerDesc": "Site institucional feito para a empresa júnior Code Tower. Página única, onde são mostrados os serviços, sobre a empresa, artigos e os projetos. Para os blogs foi utilizada a plataform Dev.to para escrita dos artigos, e na aplicação consumimos a api para pegar os dados e exibi-los. E para cadastro dos projetos de forma mais fácil, foi utilizado o HygraphCMS para administrar o conteúdo dos projetos, e para buscar esses dados do CSM utilizo GraphQL.",
        "isaludDesc": "Site institucional feito para a empresa júnior Code Tower. Página única, onde são mostrados os serviços, sobre a empresa, artigos e os projetos. Para os blogs foi utilizada a plataform Dev.to para escrita dos artigos, e na aplicação consumimos a api para pegar os dados e exibi-los. E para cadastro dos projetos de forma mais fácil, foi utilizado o HygraphCMS para administrar o conteúdo dos projetos, e para buscar esses dados do CSM utilizo GraphQL",
        "erpconteDesc": "Site institucional feito para a empresa júnior Code Tower. Página única, onde são mostrados os serviços, sobre a empresa, artigos e os projetos. Para os blogs foi utilizada a plataform Dev.to para escrita dos artigos, e na aplicação consumimos a api para pegar os dados e exibi-los. E para cadastro dos projetos de forma mais fácil, foi utilizado o HygraphCMS para administrar o conteúdo dos projetos, e para buscar esses dados do CSM utilizo GraphQL",
        "pdvconteDesc": "Construção e manutenção de um aplicativo para ponto de vendas(PDV). Aplicativo integrado com ERP, onde é possível fazer vendas de produtos, emitir nota fiscal e cupom não fiscal, além de gerenciar o caixa. Além disso tem conexão com a impressora integrada do dispositivo Elgin Mini PDV M10, fazendo impressão automática das notas fiscais.",
        "viamDesc": "Refiz um aplicativo android nativo em React Native, recriando todas as funcionalidades e interface em React-Native. Além das funcionalidades recriadas, também implementei novas features, como login por biometria, tanto facial no IOS, quanto Digital no Android, além de implementar um sistema de alertas e notificações."
    }
}